
# 5와 사칙연산만으로 12를 표현 가능
# 숫자 N과 number가 주어질 때, N과 사칙연산만 사용해서 표현할 수 있는 방법 중
# N 사용 횟수의 최솟값을 return하도록
# solution 함수 작성

# N은 1이상 9이하
# number는 1이상 32,000이하
# 수식에는 괄호, 사칙연산만 가능
# 나누기 연산에서 나머지는 무시 == 몫만 보겠다는 뜻> //
# 최솟값이 8보다 크면 -1 리턴


"""
수도코드 먼저 작성
사칙 연산 + - * // 
N*N보다 작은 경우에는 N+N (N*k)를 할 수 있는데 까지 하고 나머지는 (N/N)==1 로 채워주기

55 / 5
NN / N -> 항상 11
(55+5)/5
( NN + N ) / N -> 항상 12

( NN + N* 3) / N -> 항상 11 + K  , N의 개수는 3+K



while True:

"""


def solution(N, number):
    answer = 0




    return answer